smock-common/common/src/test/resources/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:test="http://javacrumbs.net/test">
   <soapenv:Header/>
   <soapenv:Body>
      <test:testMethod>
         <text>Lukas</text>
      </test:testMethod>
   </soapenv:Body>
</soapenv:Envelope>